<p>
</p>
<p>
	 Мы предоставляем нашим клиентам лучший сервис и гарантируем максимально быструю и безопасную доставку покупок в любую точку России.
</p>
<p>
 <b>Сколько стоит доставка?</b><br>
	 Стоимость доставки по России рассчитывается индивидуально.
</p>
<p>
 <b>Как отследить заказ?</b><br>
	 Отследить статус своего заказа можно по трек-номеру на сайте транспортной компании.
</p>
<p>
 <b>Какие способы доставки?</b><br>
	 При оформлении заказа вы можете выбрать удобный тип доставки из предложенных: Почта России или СДЭК.&nbsp;
</p>
 <br>
 <br>
 <br>
 <br>