<p>
    Благодаря хорошему коллективу на производстве и упорному труду, удалось увеличить ассортимент
    одежды и к середине 2020 года бренд стал партнёром интернет-площадки Wildberries. На тот
    момент ассортимент магазина составляли 15 моделей одежды (брюки, платья, пиджаки, куртки,
    пальто), а к концу 2020 года был открыт первый оффлайн магазин. Производство было основано
    родителями - Камо и Еленой Хачатурян, окончившими Ростовский институт по профессии
    конструктор-модельер швейных изделий.</p>