<?if(!defined('B_PROLOG_INCLUDED') || B_PROLOG_INCLUDED !== true)
die();
use Bitrix\Main\Page\Asset;
?>
<?$APPLICATION->SetAdditionalCSS(SITE_TEMPLATE_PATH.'/css/plugins.css');?>
<?$APPLICATION->SetAdditionalCSS(SITE_TEMPLATE_PATH.'/css/core.css');?>
<?$APPLICATION->SetAdditionalCSS('https://cdn.jsdelivr.net/npm/@fancyapps/ui@5.0/dist/fancybox/fancybox.css');?>
<?$APPLICATION->SetAdditionalCSS(SITE_TEMPLATE_PATH.'/css/custom.css');?>
<?$APPLICATION->AddHeadScript(SITE_TEMPLATE_PATH.'/js/plugins.js');?>
<?$APPLICATION->AddHeadScript(SITE_TEMPLATE_PATH.'/js/app.js')?>
<?$APPLICATION->AddHeadScript('https://cdn.jsdelivr.net/npm/@fancyapps/ui@5.0/dist/fancybox/fancybox.umd.js')?>
<?$APPLICATION->AddHeadScript(SITE_TEMPLATE_PATH.'/js/custom.js')?>
<?global $USER;?>
<!DOCTYPE html>
<html lang="<?=LANGUAGE_ID?>">
<head>
    <meta http-equiv="x-ua-compatible" content="ie=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <?$APPLICATION->ShowHead();?>
    <title><?$APPLICATION->ShowTitle()?></title>
</head>
<body itemscope itemtype="https://schema.org/WebPage">
<div id="panel"><?$APPLICATION->ShowPanel();?></div>
    <header class="header <?=$APPLICATION->GetCurPage()==='/' ? 'header__home' :''?>" itemscope itemtype="https://schema.org/WPHeader">
        <div class="container">
            <div class="header__items">
                <div class="header__logo">
                    <div class="header__logo__icon">
                        <a href="/" aria-label="homepage">
                            <svg width="162" height="27" viewBox="0 0 162 27" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                    d="M25.6192 0.749817H29.7413V0.998977C28.3377 1.07226 27.6286 1.80509 27.6286 3.19747C27.6286 3.4906 27.6581 3.90098 27.732 4.42862L30.5096 24.3177C30.6721 25.3143 30.8642 25.9592 31.0711 26.2377C31.2779 26.5162 31.7212 26.6774 32.3712 26.736V26.9852H26.4022V26.736C27.1853 26.7653 27.5843 26.3842 27.5843 25.5928C27.5843 25.4169 27.5547 25.0652 27.4808 24.5375L24.7919 5.24939L15.3066 26.9852H15.1293L5.58485 5.29336L2.91065 24.6841C2.86632 24.9772 2.83679 25.3143 2.83679 25.6954C2.83679 26.3843 3.23572 26.736 4.04832 26.736V26.9852H0V26.736C0.620534 26.736 1.00475 26.6627 1.18204 26.5015C1.35934 26.3549 1.49225 26.1058 1.58089 25.7833C1.68432 25.4609 1.75823 25.0945 1.80255 24.6841L4.81654 3.47595C4.32898 2.28876 3.84142 1.58525 3.33908 1.35074C2.83674 1.11624 2.36401 0.998977 1.92077 0.998977V0.749817H6.91451L16.2374 22.2071L25.6192 0.749817ZM44.25 0.749817V0.998977C43.9102 0.955007 43.5261 1.01363 43.0976 1.1602C42.6692 1.30677 42.418 1.51197 42.3441 1.79045C42.2702 2.06892 42.2259 2.71383 42.2259 3.72513V23.8926C42.2259 24.9919 42.2702 25.6514 42.3589 25.9006C42.4475 26.1497 42.6248 26.3403 42.876 26.5015C43.1271 26.6627 43.5851 26.7507 44.25 26.7507V26.9998H37.1878V26.7507C38.0743 26.7507 38.6357 26.5748 38.8573 26.2524C39.0789 25.9153 39.1823 25.1384 39.1823 23.9366V3.9596C39.1823 2.71379 39.0641 1.89304 38.8277 1.51197C38.5913 1.1309 38.0446 0.955021 37.2025 1.01365V0.764465H44.25V0.749817Z" />
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                    d="M69 1.13715V0.88931H85.7188V3.93631H85.4681V3.8051C85.4386 3.79052 85.4387 3.74677 85.4387 3.70304C85.2028 2.81373 84.8636 2.25973 84.4361 2.05562C84.0085 1.85152 83.3451 1.74946 82.4605 1.74946H73.9389V13.2668H81.8855C82.5785 13.2668 83.0355 13.2084 83.2861 13.1064C83.5368 13.0043 83.6842 12.7565 83.7137 12.392H83.9644V14.8558H83.7137C83.7137 14.2727 83.3156 13.9811 82.5342 13.9811H73.9389V24.405C73.9389 25.3818 74.0864 26.0232 74.396 26.3002C74.7056 26.5918 75.2216 26.723 75.9587 26.723V26.9709H69.0148V26.723C69.8256 26.723 70.3564 26.5772 70.5628 26.2565C70.7839 25.9504 70.8872 25.513 70.8872 24.959V3.46977C70.8872 2.59504 70.7545 1.98272 70.5038 1.63282C70.2385 1.31209 69.7519 1.13715 69 1.13715ZM102.895 0.88931V1.13715C102.555 1.09341 102.172 1.15173 101.745 1.29752C101.317 1.4433 101.066 1.64742 100.993 1.92442C100.919 2.20142 100.875 2.8429 100.875 3.84884V23.9093C100.875 25.0027 100.919 25.6587 101.007 25.9066C101.096 26.1544 101.273 26.344 101.523 26.5043C101.774 26.6647 102.231 26.7522 102.895 26.7522V27H95.8474V26.7522C96.732 26.7522 97.2922 26.5772 97.5133 26.2565C97.7345 25.9212 97.8377 25.1485 97.8377 23.953V4.08206C97.8377 2.84286 97.7197 2.02647 97.4838 1.64742C97.2479 1.26837 96.7024 1.09343 95.862 1.15174V0.903881H102.895V0.88931ZM145.178 0.0145931L143.925 3.13444H143.674C143.718 2.94492 143.748 2.6825 143.748 2.36177C143.748 2.08477 143.645 1.90983 143.453 1.82236C143.261 1.74946 142.952 1.70572 142.509 1.70572H135.595V24.0697C135.595 25.0027 135.669 25.6296 135.816 25.9649C135.964 26.3002 136.17 26.5043 136.435 26.6064C136.686 26.6939 137.114 26.7376 137.689 26.7376V26.9855H130.523V26.7376C131.423 26.6793 131.983 26.5043 132.204 26.2273C132.425 25.9357 132.543 25.3526 132.543 24.4487V1.70572H125.923C125.26 1.70572 124.818 1.74946 124.611 1.82236C124.405 1.89525 124.316 2.09937 124.316 2.40552C124.316 2.56589 124.361 2.79916 124.464 3.11989H124.213L122.96 0H123.211C123.432 0.408208 123.638 0.656062 123.845 0.743535C124.051 0.831008 124.508 0.874739 125.201 0.874739H142.76C143.453 0.874739 143.954 0.831008 144.249 0.743535C144.559 0.656062 144.78 0.408208 144.927 0H145.178V0.0145931ZM162 0.88931V1.13715C161.661 1.09341 161.278 1.15173 160.85 1.29752C160.422 1.4433 160.172 1.64742 160.098 1.92442C160.024 2.20142 159.98 2.8429 159.98 3.84884V23.9093C159.98 25.0027 160.024 25.6587 160.113 25.9066C160.201 26.1544 160.378 26.344 160.629 26.5043C160.88 26.6647 161.337 26.7522 162 26.7522V27H154.953V26.7522C155.837 26.7522 156.398 26.5772 156.619 26.2565C156.84 25.9212 156.943 25.1485 156.943 23.953V4.08206C156.943 2.84286 156.825 2.02647 156.575 1.64742C156.339 1.26837 155.793 1.09343 154.953 1.15174V0.903881H162V0.88931Z" />
                            </svg>
                        </a>
                    </div>
                </div>
                <?$APPLICATION->IncludeComponent(
	"bitrix:menu", 
	"header_menu", 
	array(
		"ROOT_MENU_TYPE" => "top",
		"MAX_LEVEL" => "2",
		"CHILD_MENU_TYPE" => "submenu",
		"USE_EXT" => "N",
		"DELAY" => "N",
		"ALLOW_MULTI_SELECT" => "Y",
		"MENU_CACHE_TYPE" => "A",
		"MENU_CACHE_TIME" => "3600",
		"MENU_CACHE_USE_GROUPS" => "Y",
		"MENU_CACHE_GET_VARS" => array(
		),
		"COMPONENT_TEMPLATE" => "header_menu"
	),
	false
);?>
                <div class="header__panel">
                    <div class="header__panel__items">
                        <div class="header__panel__item">
                            <div class="header__panel__search">
                                <div class="search__icon">
                                    <svg width="25" height="25" viewBox="0 0 25 25" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M11.373 0C11.7889 0.0623839 12.2069 0.112291 12.6193 0.189231C14.5498 0.548978 16.2487 1.38284 17.7161 2.69152C19.4781 4.2629 20.6371 6.19403 21.0904 8.51124C21.7218 11.74 21.0162 14.6692 18.9998 17.2769C18.9056 17.3989 18.8099 17.5195 18.672 17.6969C18.7475 17.7475 18.8328 17.7863 18.8952 17.8487C20.784 19.7327 22.6715 21.6181 24.5541 23.5083C24.7225 23.6775 24.8507 23.8854 24.9977 24.0753V24.4171C24.9658 24.4815 24.9353 24.5467 24.9013 24.6098C24.6851 25.0042 24.2033 25.1213 23.8346 24.8641C23.7424 24.7997 23.6613 24.7165 23.5809 24.6361C21.6705 22.7265 19.7602 20.8161 17.8513 18.9044C17.7882 18.8413 17.7376 18.7658 17.6814 18.6958C17.3383 18.9543 17.034 19.1976 16.7152 19.4201C15.1896 20.4855 13.4927 21.1163 11.6441 21.2708C8.62192 21.5238 5.93733 20.6706 3.64368 18.6646C1.8595 17.1043 0.690845 15.1634 0.232669 12.8372C-0.444542 9.39848 0.355358 6.3181 2.64831 3.65639C4.20029 1.85349 6.16468 0.718108 8.49299 0.226661C8.90542 0.139324 9.32824 0.104666 9.74621 0.0443619C9.81692 0.0332714 9.88692 0.0145562 9.95693 0C10.429 0 10.901 0 11.373 0ZM10.6459 19.8277C15.6782 19.8346 19.8191 15.718 19.8122 10.6697C19.806 5.57643 15.7053 1.52009 10.6598 1.50276C5.62818 1.48543 1.50599 5.60069 1.49421 10.6559C1.48173 15.6882 5.606 19.8214 10.6459 19.8277Z" />
                                    </svg>
                                </div>
                            </div>
                        </div>
                        <div class="header__panel__item">
                            <div class="header__panel__personal <?=\Bitrix\Main\Engine\CurrentUser::get()->getId() ? 'active': ''?>">
                            <?if(\Bitrix\Main\Engine\CurrentUser::get()->getId()):?>
                                <a href="/personal/">
                                <div class="personal__icon">
                                    <svg width="24" height="25" viewBox="0 0 24 25" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M22.3373 25C22.3497 24.9985 22.3613 24.9969 22.3737 24.9961C22.7531 24.9907 23.1503 24.9364 23.532 24.976C23.532 23.166 23.532 21.3553 23.5297 19.5454C23.5297 19.2754 23.5219 19 23.473 18.7362C23.127 16.8867 21.6251 15.6625 19.6988 15.661C14.4148 15.6579 9.13013 15.6587 3.84619 15.6633C3.55759 15.6633 3.26356 15.685 2.98195 15.744C1.2015 16.1156 0.00910393 17.5989 0.00367336 19.4515C-0.00175721 21.2746 -0.000205617 23.0978 0.000570179 24.9216C0.406311 24.9178 0.812052 24.8891 1.21547 24.9085V24.2785C1.21547 24.2785 1.1984 22.8821 1.19762 22.7983C1.19685 21.685 1.19374 20.5725 1.19762 19.4593C1.20305 17.9472 2.25503 16.865 3.76318 16.8619C9.1053 16.8534 14.4467 16.8526 19.7888 16.8619C21.276 16.8642 22.3357 17.9566 22.3411 19.4445C22.3442 20.1978 22.3396 23.1629 22.3357 24.9992L22.3373 25Z" />
                                        <path
                                            d="M11.7663 15.1808C7.62198 15.1893 4.17978 11.7898 4.17822 7.68659C4.1759 3.38559 7.53276 0.00932541 11.8206 1.58726e-05C15.9238 -0.00851787 19.3543 3.42515 19.3629 7.55161C19.3722 11.7657 15.9796 15.1722 11.7663 15.1808ZM5.58009 7.5966C5.55604 10.9581 8.33726 13.7634 11.719 13.7898C15.1216 13.8162 17.9331 11.0504 17.9494 7.66022C17.9664 4.20793 15.2442 1.43369 11.8167 1.40964C8.3714 1.38559 5.60569 4.13035 5.58009 7.5966Z" />
                                    </svg>
                                </div>
                                </a>
                            <?else:?>
                                <div class="personal__icon">
                                    <svg width="24" height="25" viewBox="0 0 24 25" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M22.3373 25C22.3497 24.9985 22.3613 24.9969 22.3737 24.9961C22.7531 24.9907 23.1503 24.9364 23.532 24.976C23.532 23.166 23.532 21.3553 23.5297 19.5454C23.5297 19.2754 23.5219 19 23.473 18.7362C23.127 16.8867 21.6251 15.6625 19.6988 15.661C14.4148 15.6579 9.13013 15.6587 3.84619 15.6633C3.55759 15.6633 3.26356 15.685 2.98195 15.744C1.2015 16.1156 0.00910393 17.5989 0.00367336 19.4515C-0.00175721 21.2746 -0.000205617 23.0978 0.000570179 24.9216C0.406311 24.9178 0.812052 24.8891 1.21547 24.9085V24.2785C1.21547 24.2785 1.1984 22.8821 1.19762 22.7983C1.19685 21.685 1.19374 20.5725 1.19762 19.4593C1.20305 17.9472 2.25503 16.865 3.76318 16.8619C9.1053 16.8534 14.4467 16.8526 19.7888 16.8619C21.276 16.8642 22.3357 17.9566 22.3411 19.4445C22.3442 20.1978 22.3396 23.1629 22.3357 24.9992L22.3373 25Z" />
                                        <path
                                            d="M11.7663 15.1808C7.62198 15.1893 4.17978 11.7898 4.17822 7.68659C4.1759 3.38559 7.53276 0.00932541 11.8206 1.58726e-05C15.9238 -0.00851787 19.3543 3.42515 19.3629 7.55161C19.3722 11.7657 15.9796 15.1722 11.7663 15.1808ZM5.58009 7.5966C5.55604 10.9581 8.33726 13.7634 11.719 13.7898C15.1216 13.8162 17.9331 11.0504 17.9494 7.66022C17.9664 4.20793 15.2442 1.43369 11.8167 1.40964C8.3714 1.38559 5.60569 4.13035 5.58009 7.5966Z" />
                                    </svg>
                                </div>
                            <?endif;?>
                            </div>
                        </div>
                        <div class="header__panel__item">
                            <div class="header__panel__favorites <?=count(\CatalogHelper\favorites::getAll()) !== 0 ? 'active': '';?>">
                            <a href="/favorites/" aria-label="favorites">
                                <div class="favorites__icon">
                                    <svg width="29" height="25" viewBox="0 0 29 25" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M14.1465 3.13589C14.6373 2.67412 15.0419 2.25579 15.4852 1.8817C20.1198 -2.02565 27.1743 0.472257 28.2651 6.42862C28.7309 8.97399 28.0375 11.2346 26.3143 13.1718C26.2008 13.2989 26.0786 13.4187 25.9587 13.5394C22.2677 17.2304 18.5768 20.9205 14.8858 24.6107C14.367 25.1295 14.0323 25.1295 13.5134 24.609C9.80556 20.8932 6.0953 17.1789 2.38987 13.4606C-0.717835 10.344 -0.803915 5.56541 2.18392 2.40542C5.0712 -0.646774 10.0815 -0.797212 13.157 2.08363C13.5005 2.40542 13.8038 2.76985 14.1457 3.13508L14.1465 3.13589ZM14.1996 23.2374C14.26 23.1827 14.2986 23.1513 14.3332 23.1159C17.9115 19.54 21.5043 15.977 25.0617 12.3802C26.5122 10.9136 27.0906 9.09627 26.7921 7.05531C26.4358 4.62337 25.0834 2.89374 22.8043 1.99433C20.5357 1.09895 18.3837 1.45372 16.4602 2.9589C15.8947 3.40137 15.4096 3.94841 14.8931 4.45443C14.3573 4.97895 14.0452 4.98539 13.5198 4.46489C13.0701 4.02001 12.6373 3.55663 12.1683 3.13347C10.573 1.69185 8.69538 1.13273 6.59569 1.57278C4.10904 2.09328 2.42848 3.61697 1.70606 6.0481C0.98927 8.46074 1.58539 10.6216 3.36087 12.4091C6.89012 15.9633 10.4427 19.495 13.9864 23.0355C14.0492 23.0982 14.116 23.1578 14.2004 23.2374H14.1996Z" />
                                    </svg>
                                </div>
                                </a>
                            </div>
                            <div class="favorites__quantity"><?=count(\CatalogHelper\favorites::getAll()) !==0 ? count(\CatalogHelper\favorites::getAll()) : '';?></div>
                        </div>
                        <div class="header__panel__item">
                        <?$APPLICATION->IncludeComponent(
	"bitrix:sale.basket.basket.line", 
	"header_item", 
	array(
		"HIDE_ON_BASKET_PAGES" => "Y",
		"PATH_TO_BASKET" => "",
		"PATH_TO_ORDER" => "/personal/order/make/",
		"PATH_TO_PERSONAL" => SITE_DIR."personal/",
		"PATH_TO_PROFILE" => SITE_DIR."personal/",
		"PATH_TO_REGISTER" => SITE_DIR."login/",
		"POSITION_FIXED" => "N",
		"POSITION_HORIZONTAL" => "right",
		"POSITION_VERTICAL" => "top",
		"SHOW_AUTHOR" => "N",
		"SHOW_DELAY" => "N",
		"SHOW_EMPTY_VALUES" => "N",
		"SHOW_IMAGE" => "Y",
		"SHOW_NOTAVAIL" => "N",
		"SHOW_NUM_PRODUCTS" => "Y",
		"SHOW_PERSONAL_LINK" => "N",
		"SHOW_PRICE" => "Y",
		"SHOW_PRODUCTS" => "N",
		"SHOW_SUMMARY" => "Y",
		"SHOW_TOTAL_PRICE" => "N",
		"COMPONENT_TEMPLATE" => "header_item",
		"PATH_TO_AUTHORIZE" => "",
		"SHOW_REGISTRATION" => "Y"
	),
	false
);?>
                        </div>
                        <div class="header__panel__item">
                            <div class="header__panel__mobile--navbar">
                                <div class="navbar__icon">
                                    <svg width="26" height="21" viewBox="0 0 26 21" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <rect class="top__line" width="25.8462" height="1.61538" rx="0.807692" />
                                        <rect class="middle__line" y="9.69231" width="25.8462" height="1.61538"
                                            rx="0.807692" />
                                        <rect class="bottom__line" y="19.3846" width="25.8462" height="1.61538"
                                            rx="0.807692" />
                                    </svg>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </header>
    <aside itemscope itemtype="https://schema.org/WPSideBar">
        <nav class="header__menu--mob">
            <div class="header__menu--mob__head">
                <div class="header__menu--mob__title">
                    <span>Меню</span>
                </div>
                <div class="header__menu--mob__close">
                    <svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M1 23.9993L24 1" stroke="#1D1D1D" stroke-linecap="round" />
                        <path d="M1 1.0007L24 24" stroke="#1D1D1D" stroke-linecap="round" />
                    </svg>
                </div>
            </div>
            <div class="header__menu--mob__body">
            <?$APPLICATION->IncludeComponent(
                    "bitrix:menu", 
                    "aside_mob", 
                    array(
                        "ROOT_MENU_TYPE" => "aside",
                        "MAX_LEVEL" => "2",
                        "CHILD_MENU_TYPE" => "submenu",
                        "USE_EXT" => "N",
                        "DELAY" => "N",
                        "ALLOW_MULTI_SELECT" => "Y",
                        "MENU_CACHE_TYPE" => "A",
                        "MENU_CACHE_TIME" => "3600",
                        "MENU_CACHE_USE_GROUPS" => "Y",
                        "MENU_CACHE_GET_VARS" => array(
                        ),
                        "COMPONENT_TEMPLATE" => "aside_mob"
                    ),
                    false
                );?>
                <div class="header__menu--mob__social">
                    <div class="header__menu--mob__social--items">
                        <a href="#" aria-label="Telegram">
                            <div class="header__menu--mob__social--item">
                                <svg width="20" height="18" viewBox="0 0 20 18" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                        d="M4.30666 10.7696C4.3497 10.7844 4.39314 10.7948 4.43653 10.8012C4.48385 10.9144 4.545 11.0607 4.61633 11.2318C4.79042 11.6494 5.02499 12.2143 5.26711 12.8035C5.76088 14.0052 6.25895 15.2439 6.36895 15.5985C6.50513 16.0368 6.64907 16.3348 6.80621 16.5383C6.88745 16.6435 6.98142 16.7353 7.09138 16.8049C7.14673 16.8399 7.2052 16.8686 7.26624 16.89C7.26892 16.891 7.27161 16.8919 7.27429 16.8928C7.58891 17.0136 7.87575 16.9633 8.05534 16.9018C8.15143 16.8688 8.22918 16.8291 8.28428 16.7969C8.31238 16.7804 8.33611 16.7651 8.35505 16.7521L8.35952 16.7491L11.1381 14.9866L14.3475 17.4894C14.3949 17.5263 14.4465 17.5573 14.5012 17.5816C14.8868 17.7527 15.2602 17.8124 15.6114 17.7636C15.962 17.7149 16.2404 17.5651 16.4476 17.3964C16.6506 17.2313 16.7881 17.0463 16.8738 16.9089C16.9176 16.8387 16.9504 16.7766 16.9736 16.7291C16.9852 16.7052 16.9946 16.6846 17.0018 16.6681L17.0111 16.6463L17.0146 16.6377L17.016 16.6341L17.0167 16.6324L17.0173 16.6308C17.0342 16.5879 17.0471 16.5435 17.056 16.4982L19.9859 1.47274C19.9953 1.42469 20 1.37581 20 1.32682C20 0.886811 19.837 0.468409 19.4537 0.214515C19.1262 -0.00248222 18.7613 -0.0118227 18.5306 0.00598236C18.2819 0.0251888 18.0521 0.0876563 17.8979 0.137572C17.8177 0.16355 17.7504 0.188614 17.7019 0.207735C17.6775 0.217345 17.6576 0.22559 17.6427 0.231878L17.6315 0.236665L1.19969 6.79321L1.19756 6.79399C1.18709 6.79786 1.17364 6.80297 1.15767 6.80929C1.12585 6.82189 1.08322 6.83965 1.03342 6.8626C0.936301 6.90738 0.800058 6.97734 0.660249 7.07473C0.436893 7.23031 -0.0767844 7.65641 0.00971265 8.35971C0.0787176 8.92078 0.456615 9.26537 0.686854 9.43107C0.813277 9.52206 0.933381 9.58713 1.02085 9.62949C1.06143 9.64913 1.14568 9.68395 1.18224 9.69905L1.19146 9.70287L4.30666 10.7696ZM18.2065 1.61786L18.2043 1.61888C18.1961 1.6225 18.1878 1.62596 18.1795 1.62928L1.72778 8.19378C1.71918 8.19721 1.71053 8.20047 1.70182 8.20357L1.69266 8.2071C1.68214 8.21127 1.66442 8.21858 1.64218 8.22884C1.62957 8.23465 1.61641 8.24099 1.60299 8.2478C1.62142 8.25836 1.63907 8.26754 1.65475 8.27513C1.6698 8.28242 1.68128 8.2874 1.68756 8.29003L4.77718 9.34802C4.83373 9.36738 4.88645 9.39304 4.93484 9.42397L15.1366 3.34948L15.1461 3.34374C15.1536 3.33927 15.1633 3.33353 15.175 3.3268C15.1982 3.31345 15.2301 3.29568 15.2681 3.27603C15.3389 3.23938 15.4522 3.18497 15.5798 3.14485C15.6686 3.11692 15.9306 3.03823 16.2139 3.13064C16.3887 3.18767 16.5697 3.31028 16.6874 3.51798C16.7458 3.62117 16.777 3.72483 16.7921 3.81972C16.8322 3.9692 16.8258 4.11681 16.7945 4.24424C16.7269 4.51875 16.5373 4.73287 16.3647 4.89665C16.2169 5.03706 14.3043 6.91292 12.4176 8.76468C11.4767 9.68813 10.5453 10.6025 9.84925 11.2859L9.39205 11.7349L15.1649 16.2367C15.2973 16.2849 15.3756 16.2825 15.4118 16.2774C15.455 16.2714 15.4903 16.2545 15.5263 16.2252C15.5667 16.1924 15.602 16.148 15.6283 16.1057L15.6294 16.104L18.4711 1.53102C18.4289 1.54133 18.3863 1.55361 18.3452 1.56691C18.2987 1.58198 18.2603 1.59634 18.2348 1.60637C18.2222 1.61134 18.2131 1.61511 18.2082 1.61719L18.2065 1.61786ZM9.888 14.0118L8.73628 13.1136L8.4572 14.9193L9.888 14.0118ZM7.67972 11.3314L8.82504 10.2067C9.52118 9.52321 10.4526 8.60879 11.3936 7.68524L12.3497 6.747L5.93964 10.5638L5.97403 10.6463C6.14874 11.0654 6.38435 11.6327 6.62775 12.2251C6.80976 12.668 7.00008 13.1344 7.17344 13.5662L7.45169 11.7658C7.47852 11.5922 7.56189 11.442 7.67972 11.3314Z"
                                        fill="#1D1D1D" />
                                </svg>
                            </div>
                        </a>
                        <a href="#" aria-label="Social">
                            <div class="header__menu--mob__social--item">
                                <svg width="24" height="21" viewBox="0 0 24 21" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M11.9832 9.09244L4.92437 2.16807L2 5.05882C3.40056 6.51541 6.42353 9.61008 7.31092 10.3361C8.42017 11.2437 9.56303 12.1176 12.2521 12.1176C14.4034 12.1176 16.3081 10.7507 16.9916 10.0672L22 5.05882L18.9748 2L11.9832 9.09244Z"
                                        stroke="black" stroke-width="1.5" />
                                    <path
                                        d="M14.0672 19.5462H9.83193V14.3697C10.0202 13.5899 10.6275 13.2829 10.9076 13.2269C11.2661 13.1933 12.1647 13.1462 12.8908 13.2269C13.6168 13.3076 13.9776 13.888 14.0672 14.1681V19.5462Z"
                                        stroke="black" stroke-width="1.5" />
                                </svg>
                            </div>
                        </a>
                        <a href="#" aria-label="Vk">
                            <div class="header__menu--mob__social--item">
                                <svg width="22" height="15" viewBox="0 0 22 15" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M12.0164 13.4775C5.25986 13.4775 1.15942 8.78976 1 1H4.42204C4.52871 6.72216 7.13209 9.15054 9.12778 9.64557V1H12.4084V5.93707C14.3333 5.72372 16.347 3.47752 17.0254 1H20.2509C19.7343 4.04806 17.542 6.29426 15.991 7.22078C17.542 7.96991 20.0375 9.93083 21 13.4775H17.4533C16.7042 11.1067 14.8679 9.2704 12.4084 9.02109V13.4775H12.0164Z"
                                        stroke="#1D1D1D" stroke-width="1.5" />
                                </svg>
                            </div>
                        </a>
                    </div>
                </div>
            </div>
        </nav>
<div class="header__basket" id="aside_basket">
    <?$APPLICATION->IncludeComponent(
	"bitrix:sale.basket.basket", 
	"aside_basket", 
	array(
		"ACTION_VARIABLE" => "action",
		"AUTO_CALCULATION" => "N",
		"COLUMNS_LIST" => "",
		"COMPONENT_TEMPLATE" => "aside_basket",
		"GIFTS_BLOCK_TITLE" => "Выберите один из подарков",
		"GIFTS_CONVERT_CURRENCY" => "Y",
		"GIFTS_HIDE_BLOCK_TITLE" => "N",
		"GIFTS_HIDE_NOT_AVAILABLE" => "N",
		"GIFTS_MESS_BTN_BUY" => "Выбрать",
		"GIFTS_MESS_BTN_DETAIL" => "Подробнее",
		"GIFTS_PAGE_ELEMENT_COUNT" => "4",
		"GIFTS_PRODUCT_PROPS_VARIABLE" => "prop",
		"GIFTS_PRODUCT_QUANTITY_VARIABLE" => "",
		"GIFTS_SHOW_DISCOUNT_PERCENT" => "Y",
		"GIFTS_SHOW_IMAGE" => "Y",
		"GIFTS_SHOW_NAME" => "Y",
		"GIFTS_SHOW_OLD_PRICE" => "Y",
		"GIFTS_TEXT_LABEL_GIFT" => "Подарок",
		"GIFTS_PLACE" => "BOTTOM",
		"HIDE_COUPON" => "N",
		"OFFERS_PROPS" => "",
		"PATH_TO_ORDER" => "/personal/order.php",
		"PRICE_VAT_SHOW_VALUE" => "N",
		"QUANTITY_FLOAT" => "N",
		"SET_TITLE" => "N",
		"USE_GIFTS" => "N",
		"USE_PREPAYMENT" => "N",
		"DEFERRED_REFRESH" => "N",
		"USE_DYNAMIC_SCROLL" => "N",
		"SHOW_FILTER" => "N",
		"SHOW_RESTORE" => "Y",
		"COLUMNS_LIST_EXT" => array(
			0 => "PROPERTY_STICKERS",
			1 => "PROPERTY_COLOR",
			2 => "PROPERTY_SIZE",
		),
		"COLUMNS_LIST_MOBILE" => array(
			0 => "PROPERTY_STICKERS",
			1 => "PROPERTY_COLOR",
			2 => "PROPERTY_SIZE",
		),
		"TEMPLATE_THEME" => "",
		"TOTAL_BLOCK_DISPLAY" => array(
			0 => "top",
		),
		"DISPLAY_MODE" => "compact",
		"PRICE_DISPLAY_MODE" => "N",
		"SHOW_DISCOUNT_PERCENT" => "N",
		"PRODUCT_BLOCKS_ORDER" => "props,sku,columns",
		"USE_PRICE_ANIMATION" => "N",
		"LABEL_PROP" => array(
		),
		"CORRECT_RATIO" => "N",
		"COMPATIBLE_MODE" => "Y",
		"EMPTY_BASKET_HINT_PATH" => "/",
		"ADDITIONAL_PICT_PROP_5" => "-",
		"ADDITIONAL_PICT_PROP_6" => "-",
		"BASKET_IMAGES_SCALING" => "adaptive",
		"USE_ENHANCED_ECOMMERCE" => "N",
		"ADDITIONAL_PICT_PROP_7" => "-",
		"ADDITIONAL_PICT_PROP_9" => "-"
	),
	false
);?>
</div>
        <?if(!\Bitrix\Main\Engine\CurrentUser::get()->getId()):?>
        <div class="header__personal">
            <div class="header__personal--icon">
                <svg width="29" height="30" viewBox="0 0 29 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M26.805 30C26.8199 29.9981 26.8339 29.9963 26.8488 29.9953C27.304 29.9888 27.7807 29.9236 28.2387 29.9711C28.2387 27.7992 28.2387 25.6264 28.2359 23.4544C28.2359 23.1305 28.2266 22.8 28.1679 22.4835C27.7527 20.2641 25.9504 18.795 23.6388 18.7932C17.2981 18.7894 10.9564 18.7904 4.61572 18.796C4.2694 18.796 3.91657 18.822 3.57863 18.8928C1.44209 19.3387 0.0112177 21.1187 0.004701 23.3418C-0.00181568 25.5295 4.62288e-05 27.7173 0.000977183 29.906C0.487866 29.9013 0.974755 29.8669 1.45885 29.8901V29.1342C1.45885 29.1342 1.43837 27.4585 1.43744 27.3579C1.43651 26.022 1.43278 24.687 1.43744 23.3511C1.44396 21.5367 2.70633 20.238 4.51611 20.2343C10.9267 20.224 17.3363 20.2231 23.7468 20.2343C25.5315 20.2371 26.8032 21.5479 26.8097 23.3334C26.8134 24.2374 26.8078 27.7955 26.8032 29.9991L26.805 30Z"
                        fill="black" />
                    <path
                        d="M14.1198 18.2169C9.14667 18.2271 5.01602 14.1477 5.01416 9.22388C5.01137 4.06267 9.03961 0.01116 14.185 -1.14705e-05C19.1088 -0.010252 23.2255 4.11015 23.2357 9.0619C23.2469 14.1188 19.1758 18.2067 14.1198 18.2169ZM6.6964 9.11589C6.66754 13.1497 10.005 16.516 14.063 16.5477C18.1462 16.5794 21.52 13.2605 21.5395 9.19223C21.56 5.04948 18.2933 1.72039 14.1803 1.69153C10.046 1.66267 6.72712 4.95639 6.6964 9.11589Z"
                        fill="black" />
                </svg>
            </div>
            <div class="header__personal--close">
                <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M1.0002 30.9991L30.9993 1" stroke="white" stroke-width="1.5" stroke-linecap="round" />
                    <path d="M1.0002 1.00093L30.9993 31" stroke="white" stroke-width="1.5" stroke-linecap="round" />
                </svg>
            </div>
            <div class="header__personal--tabs">
                <div class="header__personal--tabs__body">
                    <div class="header__personal--auth show" data-tab="body">
                        <div class="header__personal--title">
                            Авторизация
                        </div>
                        <div class="header__personal--form">
                                <?$APPLICATION->IncludeComponent("bitrix:system.auth.form","aside_auth",Array(
                                "REGISTER_URL" => $APPLICATION->GetCurPage(),
                                "FORGOT_PASSWORD_URL" => $APPLICATION->GetCurPage(),
                                "PROFILE_URL" => "/personal/",
                                "SHOW_ERRORS" => "Y"
                                )
                            );?>
                        </div>
                    </div>
                    <div class="header__personal--reg" data-tab="body">
                        <div class="header__personal--title">
                            Регистрация
                            <div class="header__personal--subtitle">
                                Заполните простую форму регистрации
                                и станьте участником клуба MI FI TI
                            </div>
                        </div>
                        <div class="header__personal--form">
                        <?php
                            $APPLICATION->IncludeComponent(     
                                "bitrix:main.register",
                                "aside_register",
                                array(
                                    "AUTH" => "N",              
                                    "REQUIRED_FIELDS" => array( // Поля, обязательные для заполнения
                                        1 => "LOGIN",
                                    ),
                                    "SET_TITLE" => "N",         
                                    "SHOW_FIELDS" => array(     // Поля, которые показывать в форме
                                        1 => "LOGIN",
                                    ),
                                    "SUCCESS_PAGE" => $APPLICATION->GetCurPage(),
                                    "USER_PROPERTY" => "",
                                    "USER_PROPERTY_NAME" => "",
                                    "USE_BACKURL" => "N",
                                ),
                                false
                            );
                            ?>
                        </div>
                    </div>
                    <div class="header__personal--pass" data-tab="body">
                        <div class="header__personal--title">
                            Восстановление пароля
                        </div>
                        <div class="header__personal--form">
                        <?
                        $APPLICATION->IncludeComponent("bitrix:system.auth.changepasswd", "aside_changepass", 
                        Array("SHOW_ERRORS" => "Y"),
                        false
                        );
                        ?>
                        </div>
                    </div>
                </div>
            </div>
            <div class="header__personal--tabs__titles">
                <div class="header__personal--tabs__title active" data-tab="title">Авторизация</div>
                <div class="header__personal--tabs__title" data-tab="title">Регистрация</div>
                <div class="header__personal--tabs__title" data-tab="title">Забыли пароль?</div>
            </div>
        </div>
        <?endif;?>
        <div class="header__search">
            <div class="header__search--icon">
                <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M13.6477 0C14.1467 0.0748607 14.6483 0.134749 15.1432 0.227077C17.4597 0.658774 19.4984 1.65941 21.2593 3.22982C23.3737 5.11548 24.7645 7.43283 25.3085 10.2135C26.0662 14.0879 25.2195 17.6031 22.7998 20.7322C22.6867 20.8786 22.5719 21.0234 22.4064 21.2363C22.497 21.297 22.5993 21.3436 22.6742 21.4185C24.9408 23.6793 27.2058 25.9417 29.4649 28.21C29.667 28.413 29.8209 28.6625 29.9972 28.8904V29.3005C29.959 29.3778 29.9224 29.456 29.8816 29.5317C29.6221 30.005 29.044 30.1456 28.6015 29.837C28.4909 29.7596 28.3935 29.6598 28.2971 29.5633C26.0047 27.2717 23.7123 24.9793 21.4215 22.6853C21.3458 22.6096 21.2851 22.5189 21.2177 22.4349C20.806 22.7452 20.4408 23.0371 20.0582 23.3041C18.2275 24.5826 16.1913 25.3395 13.9729 25.525C10.3463 25.8286 7.1248 24.8047 4.37242 22.3975C2.2314 20.5251 0.829013 18.1961 0.279203 15.4047C-0.533451 11.2782 0.426429 7.58172 3.17798 4.38767C5.04034 2.22419 7.39762 0.86173 10.1916 0.271994C10.6865 0.167189 11.1939 0.1256 11.6955 0.0532343C11.7803 0.0399257 11.8643 0.0174675 11.9483 0C12.5148 0 13.0812 0 13.6477 0ZM12.7751 23.7932C18.8139 23.8015 23.783 18.8616 23.7746 12.8037C23.7672 6.69171 18.8463 1.82411 12.7917 1.80331C6.75382 1.78252 1.80719 6.72082 1.79305 12.787C1.77808 18.8258 6.7272 23.7857 12.7751 23.7932Z"
                        fill="#1D1D1D" />
                </svg>
            </div>
            <div class="header__search--close">
                <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M1.0002 30.9991L30.9993 1" stroke="white" stroke-width="1.5" stroke-linecap="round" />
                    <path d="M1.0002 1.00093L30.9993 31" stroke="white" stroke-width="1.5" stroke-linecap="round" />
                </svg>
            </div>
            <div class="header__search--title">
                Поиск
            </div>
            <div class="header__search--form">
            <?$APPLICATION->IncludeComponent(
                "bitrix:search.form", 
                "aside_search", 
                array(
                    "USE_SUGGEST" => "N",
                    "PAGE" => "#SITE_DIR#search",
                    "COMPONENT_TEMPLATE" => "aside_search"
                ),
                false
            );?> 
            </div>
        </div>
    </aside>
    <main>
        <div class="content__wrap">