<p>
    Вернуть или обменять товар, не подошедший Вам по каким-либо причинам (фасон, размер, цвет) в течение 7 календарных
    дней с момента получения заказа. <br>
    <br>
    1. Заполнить электронную форму;<br>
    2. Ожидать звонка оператора для уточнения деталей, связанных с возвратом;<br>
    3. Заполнить отрывной бланк, полученный вместе с заказом, и вложить его в отправляемую посылку;<br>
    4. Обратиться в ближайший офис СДЭК или Почты России (в зависимости от региона) для отправки товара на адрес
    распределительного центра. При отправке Почтой России потребуется приобрести упаковочный пакет.<br>
</p>